app/views/comments/_comment.html.erb

INSERT INTO "comments" ("content", "micropost_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "kaka"], ["micropost_id", 299], ["created_at", "2022-05-03 07:18:25.001146"], ["updated_at", "2022-05-03 07:18:25.001146"], ["user_id", 1]]
---
    <span class="timestamp">
      Posted <%= comment.created_at %>