app/views/microposts/_micropost.html.erb

  </span>
  <b> Likes:<%= micropost.likes.count %> Comments:<%= micropost.comments.count %> </b>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."micropost_id" = ?  [["micropost_id", 299]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."micropost_id" = ?  [["micropost_id", 299]]