app/views/microposts/show.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."micropost_id" = ?  [["micropost_id", 299]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."micropost_id" = ?  [["micropost_id", 299]]
---
<div>
	<b> Likes:<%= @micropost.likes.count %> Comments:<%= @micropost.comments.count %> </b>

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."micropost_id" = ? LIMIT ?  [["user_id", 1], ["micropost_id", 299], ["LIMIT", 1]]
---
<span>
	<% like = current_user.likes.find_by(micropost: @micropost) %>

SELECT "comments".* FROM "comments" WHERE "comments"."micropost_id" = ? ORDER BY "comments"."created_at" DESC  [["micropost_id", 299]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."micropost_id" = ?  [["micropost_id", 299]]
---
	<b> Comments </b>
	<% if @micropost.comments.count != 0 %>