app/controllers/comments_controller.rb

SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY "microposts"."created_at" DESC LIMIT ?  [["id", 299], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "micropost_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "kaka"], ["micropost_id", 299], ["created_at", "2022-05-03 07:18:25.001146"], ["updated_at", "2022-05-03 07:18:25.001146"], ["user_id", 1]]
---
  def create
    @current_micropost = Micropost.find(params[:micropost_id])
    @comment = @current_micropost.comments.build(comment_params)
    @comment.user = current_user
    respond_to do |format|
      if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = ? AND "comments"."id" = ? ORDER BY "comments"."created_at" DESC LIMIT ?  [["user_id", 1], ["id", 7], ["LIMIT", 1]]
---
  def correct_user
    @comment = current_user.comments.find_by(id: params[:id])