app/controllers/likes_controller.rb

  def create
    @like = current_user.likes.new(like_params)
    if @like.save
---
INSERT INTO "likes" ("user_id", "micropost_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["micropost_id", 299], ["created_at", "2022-05-03 07:18:20.130299"], ["updated_at", "2022-05-03 07:18:20.130299"]]

  def destroy
    @like = current_user.likes.find(params[:id])
    micropost = @like.micropost
    @like.destroy
---
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."id" = ? LIMIT ?  [["user_id", 1], ["id", 13], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 13]]