app/controllers/microposts_controller.rb

SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY "microposts"."created_at" DESC LIMIT ?  [["id", 299], ["LIMIT", 1]]
---
  def show
  	@micropost = Micropost.find(params[:id])

INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "bala"], ["user_id", 1], ["created_at", "2022-04-11 16:13:52.811478"], ["updated_at", "2022-04-11 16:13:52.811478"]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? AND "microposts"."id" = ? ORDER BY "microposts"."created_at" DESC LIMIT ?  [["user_id", 1], ["id", 301], ["LIMIT", 1]]
---
  def create
	  @micropost = current_user.microposts.build(micropost_params)
	  @micropost.image.attach(params[:micropost][:image])
	  if @micropost.save
	    flash[:success] = "Micropost created!"
	    redirect_to root_url
	  else
	    @feed_items = current_user.feed.paginate(page: params[:page])

SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? AND "microposts"."id" = ? ORDER BY "microposts"."created_at" DESC LIMIT ?  [["user_id", 1], ["id", 302], ["LIMIT", 1]]
---
	  def correct_user
	    @micropost = current_user.microposts.find_by(id: params[:id])