app/controllers/users_controller.rb

SELECT 1 AS one FROM "microposts" WHERE "microposts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(page: params[:page])
    @rooms = Room.all
    @chatroom = Room.new
    check = false
    @rooms.each do |room|
      next unless Participant.where(user_id: current_user.id,
                                    room_id: room.id).exists? && Participant.where(user_id: @user.id,
                                                                                   room_id: room.id).exists?